Revit 2027 API
CompoundStructure.GetExtendableRegionIds Method
 Gets the extendable region ids for the compound structure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<int> GetExtendableRegionIds(
	bool top
)
Public Function GetExtendableRegionIds (
	top As Boolean
) As IList(Of Integer)
public:
IList<int>^ GetExtendableRegionIds(
	bool top
)
member GetExtendableRegionIds :
        top : bool -> IList<int>
Parameters
top Boolean
 If true, retrieve ids of regions which are extendable at the top, otherwise retrieve the ids of regions which are extendable at the bottom.
Return Value
IList<Int32>
 An array of region ids which are marked extendable.
Exceptions
Exception | Condition
InvalidOperationException |  This operation is valid only for vertically compound structures.
Remarks
 Regions along the top or bottom of the wall may be set to be extendable.
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace